Autodesk.Revit.DB.Electrical.ElectricalDemandPowerCalculationDetailsData.GetLoadScenarioId
Get the load scenario of the current demand load calculation data.
Returns:
The load scenario id of the current demand load calculation data.

Autodesk.Revit.DB.Electrical.ElectricalDemandPowerCalculationDetailsData.GetDemandFactorsOfLoadClassification(Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue}@)
This function will get all the descendant electrical analytical loads of the current node, and get computed demand factor for each of them.
demandFactorValuesInLoadRange:
Computed total ElectricalDemandFactorValues of given Load Classification. A computed temporary ElectricalDemandFactorValue is used to represent demand factor in
a certain load range, for example demand factor is 0.85 from 0kVA to 500kVA.
The array will be empty if the demand factor rule of the Load Classification isn't LoadTable or LoadTablePerPortion.
Returns:
The map of the electrical analytical load id and its demand factor value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The id is not a valid electrical load classification.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Electrical.ElectricalDemandPowerCalculationDetailsData.GetDemandFactorOfLoad(Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue}@)
Get the demand factor of the given electrical analytical load. The electrical analytical load must a descendant of the current node.
Remarks:
Electrical Analytical Load including Electrical Analytical Equipment Load and Electrical Analytical Area Based Load. Electrical Analytical Equipment Load is an ElectricalAnalyticalNode, and it has
an AnalyticalEquipmentLoadData. Electrical Analytical Area Based Load is a ZoneEquipment, and it has an AreaBasedLoadData.
loadId:
The electrical analytical load id.
demandFactorValuesInLoadRange:
Computed ElectricalDemandFactorValues. A computed temporary ElectricalDemandFactorValue is used to represent demand factor in
a certain load range, for example demand factor is 0.85 from 0kVA to 500kVA.
The array will be empty if the demand factor rule of the electrical analytical load's Load Classification isn't LoadTable or LoadTablePerPortion.
Returns:
The demand factor value of the given electrical analytical load.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The id is not a valid electrical analytical load.
-or-
The id is not a descendant electrical analytical load of the current node.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Electrical.ElectricalDemandPowerCalculationDetailsData.GetLoadScenarioFactorOfLoad(Autodesk.Revit.DB.ElementId)
Get the load scenario factor of the given electrical analytical load. The load scenario factor is the usage factor of the given electrical analytical load at the load scenario this data reported.
If the electrical analytical load is in a LoadSet, it will return the LoadSet's load scenario factor at the load scenario this data reported.
Remarks:
Electrical Analytical Load including Electrical Analytical Equipment Load and Electrical Analytical Area Based Load. Electrical Analytical Equipment Load is an ElectricalAnalyticalNode, and it has
an AnalyticalEquipmentLoadData. Electrical Analytical Area Based Load is a ZoneEquipment, and it has an AreaBasedLoadData.
Only Electrical Analytical Equipment Load can be added into a LoadSet.
loadId:
The electrical analytical load id.
Returns:
The load scenario factor of the given electrical analytical load.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The id is not a valid electrical analytical load.
-or-
The id is not a descendant electrical analytical load of the current node.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Electrical.ElectricalDemandPowerCalculationDetailsData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Electrical.ElectricalDemandPowerCalculationDetailsData
The functions in this class are aimed to provide demand power calculation detailed data and so that to help users
understand how the total demand power of each Load Classifcation is calculated.
Remarks:
This class provides detailed data presentation of the current demand power calculation results of the node such as the electrical equipment load's load scenario factor and demand factor.
Please note whenever you modify any parameters, the data will not be automatically updated. You need to use API GetDemandPowerCalculationDetailsData to get another new data.
The demand power calculation rule of one electrical analytical load is: (apparent power of the load) * (load scenario factor of the load) * (demand factor of the load). You can get apparent power of the
electrical analytical equipment load by AnalyticalEquipmentLoadData.ApparentLoad, and get electrical analytical area based load's apparent power by AreaBasedLoadData.ApparentLoad.